Revit 2024 API
ReinforcementRoundingManager Class
 A base class providing access to reinforcement rounding overrides for structural elements.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class ReinforcementRoundingManager : IDisposable
Visual Basic
Public Class ReinforcementRoundingManager _
	Implements IDisposable
Visual C++
public ref class ReinforcementRoundingManager : IDisposable
Remarks
 Subclasses of this class are used to access the override settings for Rebar elements and types or Fabric elements and types.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.ReinforcementRoundingManager
 Autodesk.Revit.DB.Structure.FabricRoundingManager
 Autodesk.Revit.DB.Structure.RebarRoundingManager
See Also
ReinforcementRoundingManager Members
Autodesk.Revit.DB.Structure Namespace